shangxingchen0123456789-creator/BMS-GD32/GD32G553/Driver/afe_gd30bm2016_regs.h
#ifndef AFE_GD30BM2016_REGS_H
#define AFE_GD30BM2016_REGS_H

#include <stdint.h>

/*
 * GD30BM2016 寄存器映射。
 *
 * 来源：BM2016 资料包：
 * - AN-GD30BM2016 Register Maps Rev.B
 * - AN-GD30BM2016 Commands and Subcommands Rev.A
 * - GD30BM2016_DEMO_V1.0/Application/Include/gd30bm2016.h
 *
 * 所有芯片可见地址集中放在这里，让硬件驱动文件保持简洁。
 */

#define GD30BM2016_I2C_ADDR_7BIT                         0x10U
#define GD30BM2016_I2C_ADDR_WRITE                        0x20U
#define GD30BM2016_I2C_ADDR_READ                         0x21U

/* CRC8 parameters used by the BM2016 I2C packet checksum path. */
#define GD30BM2016_CRC8_POLY                             0x07U
#define GD30BM2016_CRC8_INIT                             0x00U

/* 直接寄存器命令。 */
#define GD30BM2016_DIR_CONTROL_STATUS                    0x00U
#define GD30BM2016_DIR_SAFETY_ALERT_A                    0x02U
#define GD30BM2016_DIR_SAFETY_STATUS_A                   0x03U
#define GD30BM2016_DIR_SAFETY_ALERT_B                    0x04U
#define GD30BM2016_DIR_SAFETY_STATUS_B                   0x05U
#define GD30BM2016_DIR_SAFETY_ALERT_C                    0x06U
#define GD30BM2016_DIR_SAFETY_STATUS_C                   0x07U
#define GD30BM2016_DIR_PF_ALERT_A                        0x0AU
#define GD30BM2016_DIR_PF_STATUS_A                       0x0BU
#define GD30BM2016_DIR_PF_ALERT_B                        0x0CU
#define GD30BM2016_DIR_PF_STATUS_B                       0x0DU
#define GD30BM2016_DIR_PF_ALERT_C                        0x0EU
#define GD30BM2016_DIR_PF_STATUS_C                       0x0FU
#define GD30BM2016_DIR_PF_ALERT_D                        0x10U
#define GD30BM2016_DIR_PF_STATUS_D                       0x11U
#define GD30BM2016_DIR_BATTERY_STATUS                    0x12U
#define GD30BM2016_DIR_CELL1_VOLTAGE                     0x14U
#define GD30BM2016_DIR_CELL2_VOLTAGE                     0x16U
#define GD30BM2016_DIR_CELL3_VOLTAGE                     0x18U
#define GD30BM2016_DIR_CELL4_VOLTAGE                     0x1AU
#define GD30BM2016_DIR_CELL5_VOLTAGE                     0x1CU
#define GD30BM2016_DIR_CELL6_VOLTAGE                     0x1EU
#define GD30BM2016_DIR_CELL7_VOLTAGE                     0x20U
#define GD30BM2016_DIR_CELL8_VOLTAGE                     0x22U
#define GD30BM2016_DIR_CELL9_VOLTAGE                     0x24U
#define GD30BM2016_DIR_CELL10_VOLTAGE                    0x28U
#define GD30BM2016_DIR_CELL11_VOLTAGE                    0x2AU
#define GD30BM2016_DIR_CELL12_VOLTAGE                    0x2CU
#define GD30BM2016_DIR_CELL13_VOLTAGE                    0x2EU
#define GD30BM2016_DIR_CELL14_VOLTAGE                    0x30U
#define GD30BM2016_DIR_CELL15_VOLTAGE                    0x32U
#define GD30BM2016_DIR_STACK_VOLTAGE                     0x34U
#define GD30BM2016_DIR_PACK_PIN_VOLTAGE                  0x36U
#define GD30BM2016_DIR_LD_PIN_VOLTAGE                    0x38U
#define GD30BM2016_DIR_CC2_CURRENT                       0x3AU
#define GD30BM2016_DIR_CELL16_VOLTAGE                    0x3CU
#define GD30BM2016_DIR_SUBCMD                            0x3EU
#define GD30BM2016_DIR_SUBCMD_DATA                       0x40U
#define GD30BM2016_DIR_ALARM_STATUS                      0x62U
#define GD30BM2016_DIR_ALARM_RAW_STATUS                  0x64U
#define GD30BM2016_DIR_ALARM_ENABLE                      0x66U
#define GD30BM2016_DIR_INT_TEMPERATURE                   0x68U
#define GD30BM2016_DIR_CFETOFF_TEMPERATURE               0x6AU
#define GD30BM2016_DIR_DFETOFF_TEMPERATURE               0x6CU
#define GD30BM2016_DIR_ALERT_TEMPERATURE                 0x6EU
#define GD30BM2016_DIR_TS1_TEMPERATURE                   0x70U
#define GD30BM2016_DIR_TS2_TEMPERATURE                   0x72U
#define GD30BM2016_DIR_TS3_TEMPERATURE                   0x74U
#define GD30BM2016_DIR_HDQ_TEMPERATURE                   0x76U
#define GD30BM2016_DIR_DCHG_TEMPERATURE                  0x78U
#define GD30BM2016_DIR_DDSG_TEMPERATURE                  0x7AU
#define GD30BM2016_DIR_FET_STATUS                        0x7FU
#define GD30BM2016_DIR_SUBCMD_CHECKSUM_LEN               0x60U
#define GD30BM2016_DIR_SUBCMD_READ_LEN                   0x61U

#define GD30BM2016_CELL_VOLTAGE_LSB_MV                   1U
#define GD30BM2016_STACK_PACK_LD_LSB_MV                  8U

/* 兼容第一版驱动草稿中使用过的旧名称。 */
#define GD30BM2016_REG_CELL1_VOLTAGE_L                   GD30BM2016_DIR_CELL1_VOLTAGE
#define GD30BM2016_CELL_VOLTAGE_STRIDE                   2U
#define GD30BM2016_REG_SAFETY_ALERT                      GD30BM2016_DIR_SAFETY_ALERT_A
#define GD30BM2016_REG_SAFETY_STATUS                     GD30BM2016_DIR_SAFETY_STATUS_A
#define GD30BM2016_REG_PF_ALERT                          GD30BM2016_DIR_PF_ALERT_A
#define GD30BM2016_REG_PF_STATUS                         GD30BM2016_DIR_PF_STATUS_A

/* 无数据负载的子命令。 */
#define GD30BM2016_SUBCMD_EXIT_DEEPSLEEP                 0x0300U
#define GD30BM2016_SUBCMD_DEEPSLEEP                      0x0304U
#define GD30BM2016_SUBCMD_SHUTDOWN                       0x0308U
#define GD30BM2016_SUBCMD_RESET                          0x030CU
#define GD30BM2016_SUBCMD_PDSGTEST                       0x0310U
#define GD30BM2016_SUBCMD_FUSE_TOGGLE                    0x0314U
#define GD30BM2016_SUBCMD_PCHGTEST                       0x0318U
#define GD30BM2016_SUBCMD_FET_ENABLE                     0x0324U
#define GD30BM2016_SUBCMD_PF_ENABLE                      0x0328U
#define GD30BM2016_SUBCMD_PF_RESET                       0x0029U
#define GD30BM2016_SUBCMD_SEAL                           0x032CU
#define GD30BM2016_SUBCMD_RESET_PASSQ                    0x0330U
#define GD30BM2016_SUBCMD_PTO_RECOVER                    0x0334U
#define GD30BM2016_SUBCMD_SET_CFGUPDATE                  0x0338U
#define GD30BM2016_SUBCMD_EXIT_CFGUPDATE                 0x033CU
#define GD30BM2016_SUBCMD_DSG_PDSG_OFF                   0x0340U
#define GD30BM2016_SUBCMD_CHG_PCHG_OFF                   0x0344U
#define GD30BM2016_SUBCMD_ALL_FETS_OFF                   0x0348U
#define GD30BM2016_SUBCMD_ALL_FETS_ON                    0x034CU
#define GD30BM2016_SUBCMD_SLEEP_ENABLE                   0x0350U
#define GD30BM2016_SUBCMD_SLEEP_DISABLE                  0x0354U
#define GD30BM2016_SUBCMD_OCDL_RECOVER                   0x0358U
#define GD30BM2016_SUBCMD_SCDL_RECOVER                   0x035CU
#define GD30BM2016_SUBCMD_LOAD_DETECT_RESTART            0x0360U
#define GD30BM2016_SUBCMD_LOAD_DETECT_ON                 0x0364U
#define GD30BM2016_SUBCMD_LOAD_DETECT_OFF                0x0368U
#define GD30BM2016_SUBCMD_CFETOFF_LO                     0x036CU
#define GD30BM2016_SUBCMD_DFETOFF_LO                     0x0370U
#define GD30BM2016_SUBCMD_ALERT_LO                       0x0374U
#define GD30BM2016_SUBCMD_HDQ_LO                         0x0378U
#define GD30BM2016_SUBCMD_DCHG_LO                        0x037CU
#define GD30BM2016_SUBCMD_DDSG_LO                        0x0380U
#define GD30BM2016_SUBCMD_CFETOFF_HI                     0x0384U
#define GD30BM2016_SUBCMD_DFETOFF_HI                     0x0388U
#define GD30BM2016_SUBCMD_ALERT_HI                       0x038CU
#define GD30BM2016_SUBCMD_HDQ_HI                         0x0390U
#define GD30BM2016_SUBCMD_DCHG_HI                        0x0394U
#define GD30BM2016_SUBCMD_DDSG_HI                        0x0398U
#define GD30BM2016_SUBCMD_PF_FORCE_A                     0x039CU
#define GD30BM2016_SUBCMD_PF_FORCE_B                     0x03A0U
#define GD30BM2016_SUBCMD_SWAP_COMM_MODE                 0x03A4U
#define GD30BM2016_SUBCMD_SWAP_TO_I2C                    0x03A8U
#define GD30BM2016_SUBCMD_SLEEP                          0x03B4U
#define GD30BM2016_SUBCMD_CHIP_RESET                     0x03CCU

