shangxingchen0123456789-creator/BMS-GD32/GD32G553/Driver/afe_gd30bm2016_regs.h
/* 带数据负载的子命令。 */
#define GD30BM2016_CMD_DEVICE_NUMBER                     0x0000U
#define GD30BM2016_CMD_HW_VERSION                        0x000CU
#define GD30BM2016_CMD_SYS_STATE                         0x0010U
#define GD30BM2016_CMD_OTP_STATE                         0x0012U
#define GD30BM2016_CMD_ADC_STATE                         0x0013U
#define GD30BM2016_CMD_PT_STATE                          0x0014U
#define GD30BM2016_CMD_CB_STATE                          0x0015U
#define GD30BM2016_CMD_UNSEAL_KEYSTEP1                   0x0020U
#define GD30BM2016_CMD_UNSEAL_KEYSTEP2                   0x0022U
#define GD30BM2016_CMD_FULL_ACCESS_KEYSTEP1              0x0024U
#define GD30BM2016_CMD_FULL_ACCESS_KEYSTEP2              0x0026U
#define GD30BM2016_CMD_SAVED_PF_STATUS_A                 0x0028U
#define GD30BM2016_CMD_SAVED_PF_STATUS_B                 0x0029U
#define GD30BM2016_CMD_SAVED_PF_STATUS_C                 0x002AU
#define GD30BM2016_CMD_SAVED_PF_STATUS_D                 0x002BU
#define GD30BM2016_CMD_FUSE_FLAG                         0x002CU
#define GD30BM2016_CMD_MANUFACTURING_STATUS              0x0030U
#define GD30BM2016_CMD_MAX_CELL_VOLTAGE                  0x0104U
#define GD30BM2016_CMD_MIN_CELL_VOLTAGE                  0x0106U
#define GD30BM2016_CMD_BATTERY_VOLTAGE_SUM               0x0108U
#define GD30BM2016_CMD_CELL_TEMP                         0x010AU
#define GD30BM2016_CMD_FET_TEMP                          0x010CU
#define GD30BM2016_CMD_MAX_CELL_TEMP                     0x010EU
#define GD30BM2016_CMD_MIN_CELL_TEMP                     0x0110U
#define GD30BM2016_CMD_CC3_CURRENT                       0x0114U
#define GD30BM2016_CMD_CC1_CURRENT                       0x0116U
#define GD30BM2016_CMD_CC2_COUNTS                        0x0118U
#define GD30BM2016_CMD_ACCUM_CHARGE                      0x0120U
#define GD30BM2016_CMD_ACCUM_CHARGE_FRACTION             0x0124U
#define GD30BM2016_CMD_ACCUM_TIME                        0x0128U
#define GD30BM2016_CMD_CELL_BALANCING_ACTIVE_CELLS       0x0200U
#define GD30BM2016_CMD_CELL_BALANCING_SET_LEVEL          0x0204U
#define GD30BM2016_CMD_CELL_BALANCING_PRESENT_TIME       0x0208U
#define GD30BM2016_CMD_FET_CONTROL                       0x0250U
#define GD30BM2016_CMD_REG12_CONTROL                     0x0254U
#define GD30BM2016_CMD_CC2_AVG_COUNTS                    0x0260U
#define GD30BM2016_CMD_PACKPIN_ADC_COUNTS                0x0268U
#define GD30BM2016_CMD_TOP_OF_STACK_ADC_COUNTS           0x026AU
#define GD30BM2016_CMD_LDPIN_ADC_COUNTS                  0x026CU
#define GD30BM2016_CMD_ACCESS_KEYSTEP1                   0x0280U
#define GD30BM2016_CMD_ACCESS_KEYSTEP2                   0x0282U

/* 系统类 Data Memory 寄存器。 */
#define GD30BM2016_DM_POWER_CONFIG                       0x8000U
#define GD30BM2016_DM_REG12_CONFIG                       0x8002U
#define GD30BM2016_DM_REG0_CONFIG                        0x8003U
#define GD30BM2016_DM_HWD_REGULATOR_OPTIONS              0x8004U
#define GD30BM2016_DM_COMM_TYPE                          0x8005U
#define GD30BM2016_DM_I2C_ADDRESS                        0x8006U
#define GD30BM2016_DM_COMM_IDLE_TIME                     0x8008U
#define GD30BM2016_DM_LOWV_SHUTDOWN_DELAY                0x8009U
#define GD30BM2016_DM_SHUTDOWN_CELL_VOLTAGE              0x800AU
#define GD30BM2016_DM_SHUTDOWN_STACK_VOLTAGE             0x800CU
#define GD30BM2016_DM_SHUTDOWN_TEMPERATURE               0x800EU
#define GD30BM2016_DM_SHUTDOWN_TEMPERATURE_DELAY         0x8010U
#define GD30BM2016_DM_SHUTDOWN_COMMAND_DELAY             0x8011U
#define GD30BM2016_DM_AUTO_SHUTDOWN_TIME                 0x8012U
#define GD30BM2016_DM_MANUFACTURING                      0x8013U
#define GD30BM2016_DM_SLEEP_CURRENT                      0x8014U
#define GD30BM2016_DM_SLEEP_HYSTERESIS_TIME              0x8016U
#define GD30BM2016_DM_VOLTAGE_TIME                       0x8017U
#define GD30BM2016_DM_WAKE_COMPARATOR_CURRENT            0x8018U
#define GD30BM2016_DM_SLEEP_CHARGER_VOLTAGE_THRESHOLD    0x801AU
#define GD30BM2016_DM_SLEEP_CHARGER_PACKTOS_DELTA        0x801CU
#define GD30BM2016_DM_CELL1_INTERCONNECT                 0x801EU
#define GD30BM2016_DM_UNSEAL_KEYSTEP1                    0x8040U
#define GD30BM2016_DM_UNSEAL_KEYSTEP2                    0x8042U
#define GD30BM2016_DM_FULL_ACCESS_KEYSTEP1               0x8044U
#define GD30BM2016_DM_FULL_ACCESS_KEYSTEP2               0x8046U
#define GD30BM2016_DM_SECURITY_SETTINGS                  0x8048U
#define GD30BM2016_DM_ADC_CLK_CFG                        0x8049U
#define GD30BM2016_DM_OTP_CTL                            0x804AU
#define GD30BM2016_DM_WDG_EN                             0x804CU
#define GD30BM2016_DM_FET_OFF_DELAY                      0x804DU
#define GD30BM2016_DM_SCAN_MODE                          0x804EU

/* 引脚与温度输入配置寄存器。 */
#define GD30BM2016_DM_CFETOFF_PIN_CONFIG                 0x8200U
#define GD30BM2016_DM_DFETOFF_PIN_CONFIG                 0x8201U
#define GD30BM2016_DM_ALERT_PIN_CONFIG                   0x8202U
#define GD30BM2016_DM_SCL_PIN_CONFIG                     0x8204U
#define GD30BM2016_DM_SDA_PIN_CONFIG                     0x8205U
#define GD30BM2016_DM_HDQ_PIN_CONFIG                     0x8206U
#define GD30BM2016_DM_DCHG_PIN_CONFIG                    0x8207U
#define GD30BM2016_DM_DDSG_PIN_CONFIG                    0x8208U
#define GD30BM2016_DM_TS1_CONFIG                         0x8209U
#define GD30BM2016_DM_TS23_CONFIG                        0x820AU
#define GD30BM2016_DM_PAD_CFG                            0x8210U

/* ADC 与校准寄存器。 */
#define GD30BM2016_DM_CELL1_GAIN                         0x8400U
#define GD30BM2016_DM_PACK_GAIN                          0x8422U
#define GD30BM2016_DM_TOS_GAIN                           0x8424U
#define GD30BM2016_DM_LD_GAIN                            0x8426U
#define GD30BM2016_DM_ADC_GAIN                           0x8428U
#define GD30BM2016_DM_CC_GAIN                            0x842CU
#define GD30BM2016_DM_CC2_GAIN                           0x8430U
#define GD30BM2016_DM_CC2_OFFSET                         0x8432U
#define GD30BM2016_DM_VCELL_OFFSET                       0x8434U
#define GD30BM2016_DM_VDIV_OFFSET                        0x8436U
#define GD30BM2016_DM_ADC_OFFSET                         0x8438U
#define GD30BM2016_DM_CC_OFFSET_SAMPLES                  0x843AU
#define GD30BM2016_DM_BOARD_OFFSET                       0x843CU
#define GD30BM2016_DM_SLEEP_MODE_OFFSET                  0x843EU
#define GD30BM2016_DM_INT_GAIN                           0x8440U
#define GD30BM2016_DM_INTERNAL_TEMP_OFFSET               0x8442U
#define GD30BM2016_DM_INT_MAXIMUM_AD                     0x8444U
#define GD30BM2016_DM_INT_MAXIMUM_TEMP                   0x8446U
#define GD30BM2016_DM_T18K_COEFF_A1                      0x8448U
#define GD30BM2016_DM_T18K_COEFF_A2                      0x844AU
#define GD30BM2016_DM_T18K_COEFF_A3                      0x844CU
#define GD30BM2016_DM_T18K_COEFF_A4                      0x844EU
#define GD30BM2016_DM_T180K_COEFF_A1                     0x8450U
#define GD30BM2016_DM_T180K_COEFF_A2                     0x8452U
#define GD30BM2016_DM_T180K_COEFF_A3                     0x8454U
#define GD30BM2016_DM_T180K_COEFF_A4                     0x8456U
#define GD30BM2016_DM_CUSTOM_COEFF_A1                    0x8458U
#define GD30BM2016_DM_CUSTOM_COEFF_A2                    0x845AU
#define GD30BM2016_DM_CUSTOM_COEFF_A3                    0x845CU
#define GD30BM2016_DM_CUSTOM_COEFF_A4                    0x845EU
#define GD30BM2016_DM_COULOMB_COUNTER_DEADBAND           0x8460U
#define GD30BM2016_DM_CC3_SAMPLES                        0x8461U
#define GD30BM2016_DM_ADC_CFG                            0x8462U
#define GD30BM2016_DM_ADC_CC1_SEL                        0x8463U
#define GD30BM2016_DM_ADC_CC2_RSENSE                     0x8464U
#define GD30BM2016_DM_CODE_GAIN                          0x8466U
#define GD30BM2016_DM_CODE_OFFSET                        0x8468U
#define GD30BM2016_DM_ADC_EN                             0x846AU

