shangxingchen0123456789-creator/BMS-GD32/GD32G553/Driver/afe_gd30bm2016_regs.h
/* 保护与 FET 相关寄存器。 */
#define GD30BM2016_DM_SF_CTRL                            0x8800U
#define GD30BM2016_DM_LOAD_REMOVE_TH                     0x8802U
#define GD30BM2016_DM_MIN_BLOW_FUSE_VOLTAGE              0x8804U
#define GD30BM2016_DM_FUSE_BLOW_TIMEOUT                  0x8806U
#define GD30BM2016_DM_DA_CONFIG                          0x8807U
#define GD30BM2016_DM_VCELL_MODE                         0x8808U
#define GD30BM2016_DM_PROTECTION_CONFIGURATION           0x880AU
#define GD30BM2016_DM_ENABLED_PROTECTIONS_A              0x880CU
#define GD30BM2016_DM_ENABLED_PROTECTIONS_B              0x880DU
#define GD30BM2016_DM_ENABLED_PROTECTIONS_C              0x880EU
#define GD30BM2016_DM_CHG_FET_PROTECTIONS_A              0x880FU
#define GD30BM2016_DM_CHG_FET_PROTECTIONS_B              0x8810U
#define GD30BM2016_DM_CHG_FET_PROTECTIONS_C              0x8811U
#define GD30BM2016_DM_DSG_FET_PROTECTIONS_A              0x8812U
#define GD30BM2016_DM_DSG_FET_PROTECTIONS_B              0x8813U
#define GD30BM2016_DM_DSG_FET_PROTECTIONS_C              0x8814U
#define GD30BM2016_DM_SF_ALERT_MASK_A                    0x8815U
#define GD30BM2016_DM_SF_ALERT_MASK_B                    0x8816U
#define GD30BM2016_DM_SF_ALERT_MASK_C                    0x8817U
#define GD30BM2016_DM_PF_ALERT_MASK_A                    0x8818U
#define GD30BM2016_DM_PF_ALERT_MASK_B                    0x8819U
#define GD30BM2016_DM_PF_ALERT_MASK_C                    0x881AU
#define GD30BM2016_DM_PF_ALERT_MASK_D                    0x881BU
#define GD30BM2016_DM_BODY_DIODE_THRESHOLD               0x881CU
#define GD30BM2016_DM_DEFAULT_ALARM_MASK                 0x881EU
#define GD30BM2016_DM_ENABLED_PF_A                       0x8820U
#define GD30BM2016_DM_ENABLED_PF_B                       0x8821U
#define GD30BM2016_DM_ENABLED_PF_C                       0x8822U
#define GD30BM2016_DM_ENABLED_PF_D                       0x8823U
#define GD30BM2016_DM_FET_OPTIONS                        0x8824U
#define GD30BM2016_DM_CHG_PUMP_CONTROL                   0x8825U
#define GD30BM2016_DM_PRECHARGE_START_VOLTAGE            0x8826U
#define GD30BM2016_DM_PRECHARGE_STOP_VOLTAGE             0x8828U
#define GD30BM2016_DM_PREDISCHARGE_TIMEOUT               0x882AU
#define GD30BM2016_DM_PREDISCHARGE_STOP_DELTA            0x882BU
#define GD30BM2016_DM_CUV_THRESHOLD                      0x882CU
#define GD30BM2016_DM_CUV_DELAY                          0x882EU
#define GD30BM2016_DM_CUV_RECOVERY_HYSTERESIS            0x8830U
#define GD30BM2016_DM_COV_THRESHOLD                      0x8832U
#define GD30BM2016_DM_COV_DELAY                          0x8834U
#define GD30BM2016_DM_COV_RECOVERY_HYSTERESIS            0x8836U
#define GD30BM2016_DM_COVL_LATCH_LIMIT                   0x8837U
#define GD30BM2016_DM_COVL_COUNTER_DEC_DELAY             0x8838U
#define GD30BM2016_DM_COVL_RECOVERY_TIME                 0x8839U
#define GD30BM2016_DM_OCC_THRESHOLD                      0x883AU
#define GD30BM2016_DM_OCC_DELAY                          0x883CU
#define GD30BM2016_DM_OCC_RECOVERY_THRESHOLD             0x8840U
#define GD30BM2016_DM_OCC_PACKTOS_DELTA                  0x8842U
#define GD30BM2016_DM_OCD1_THRESHOLD                     0x8844U
#define GD30BM2016_DM_OCD1_DELAY                         0x8846U
#define GD30BM2016_DM_OCD2_THRESHOLD                     0x8848U
#define GD30BM2016_DM_OCD2_DELAY                         0x884AU
#define GD30BM2016_DM_SCD_THRESHOLD                      0x884BU
#define GD30BM2016_DM_SCD_DELAY                          0x884CU
#define GD30BM2016_DM_SCD_RECOVERY_TIME                  0x884DU
#define GD30BM2016_DM_OCD3_THRESHOLD                     0x884EU
#define GD30BM2016_DM_OCD3_DELAY                         0x8850U
#define GD30BM2016_DM_OCD_RECOVERY_THRESHOLD             0x8852U
#define GD30BM2016_DM_OCDL_LATCH_LIMIT                   0x8854U
#define GD30BM2016_DM_OCDL_COUNTER_DEC_DELAY             0x8855U
#define GD30BM2016_DM_OCDL_RECOVERY_TIME                 0x8856U
#define GD30BM2016_DM_OCDL_RECOVERY_THRESHOLD            0x8858U
#define GD30BM2016_DM_SCDL_LATCH_LIMIT                   0x885AU
#define GD30BM2016_DM_SCDL_COUNTER_DEC_DELAY             0x885BU
#define GD30BM2016_DM_SCDL_RECOVERY_TIME                 0x885CU
#define GD30BM2016_DM_SCDL_RECOVERY_THRESHOLD            0x885EU
#define GD30BM2016_DM_OTC_THRESHOLD                      0x8860U
#define GD30BM2016_DM_OTC_DELAY                          0x8861U
#define GD30BM2016_DM_OTC_RECOVERY_THRESHOLD             0x8862U
#define GD30BM2016_DM_OTD_THRESHOLD                      0x8863U
#define GD30BM2016_DM_OTD_DELAY                          0x8864U
#define GD30BM2016_DM_OTD_RECOVERY_THRESHOLD             0x8865U
#define GD30BM2016_DM_OTF_THRESHOLD                      0x8866U
#define GD30BM2016_DM_OTF_DELAY                          0x8867U
#define GD30BM2016_DM_OTF_RECOVERY_THRESHOLD             0x8868U
#define GD30BM2016_DM_OTINT_THRESHOLD                    0x8869U
#define GD30BM2016_DM_OTINT_DELAY                        0x886AU
#define GD30BM2016_DM_OTINT_RECOVERY_THRESHOLD           0x886BU
#define GD30BM2016_DM_UTC_THRESHOLD                      0x886CU
#define GD30BM2016_DM_UTC_DELAY                          0x886DU
#define GD30BM2016_DM_UTC_RECOVERY_THRESHOLD             0x886EU
#define GD30BM2016_DM_UTD_THRESHOLD                      0x886FU
#define GD30BM2016_DM_UTD_DELAY                          0x8870U
#define GD30BM2016_DM_UTD_RECOVERY_THRESHOLD             0x8871U
#define GD30BM2016_DM_UTINT_THRESHOLD                    0x8872U
#define GD30BM2016_DM_UTINT_DELAY                        0x8873U
#define GD30BM2016_DM_UTINT_RECOVERY_THRESHOLD           0x8874U
#define GD30BM2016_DM_RECOVERY_TIME                      0x8875U
#define GD30BM2016_DM_HWD_DELAY                          0x8876U
#define GD30BM2016_DM_PTO_CHARGE_THRESHOLD               0x8878U
#define GD30BM2016_DM_PTO_DELAY                          0x887AU
#define GD30BM2016_DM_PTO_RESET                          0x887CU
#define GD30BM2016_DM_CUDEP_THRESHOLD                    0x887EU
#define GD30BM2016_DM_CUDEP_DELAY                        0x8880U
#define GD30BM2016_DM_SUV_THRESHOLD                      0x8882U
#define GD30BM2016_DM_SUV_DELAY                          0x8884U
#define GD30BM2016_DM_SOV_THRESHOLD                      0x8886U
#define GD30BM2016_DM_SOV_DELAY                          0x8888U
#define GD30BM2016_DM_TOSS_THRESHOLD                     0x888AU
#define GD30BM2016_DM_TOSS_DELAY                         0x888CU
#define GD30BM2016_DM_SOCC_THRESHOLD                     0x888EU
#define GD30BM2016_DM_SOCC_DELAY                         0x8890U
#define GD30BM2016_DM_SOCD_THRESHOLD                     0x8892U
#define GD30BM2016_DM_SOCD_DELAY                         0x8894U
#define GD30BM2016_DM_SOT_THRESHOLD                      0x8895U
#define GD30BM2016_DM_SOT_DELAY                          0x8896U
#define GD30BM2016_DM_SOTF_THRESHOLD                     0x8897U
#define GD30BM2016_DM_SOTF_DELAY                         0x8898U
#define GD30BM2016_DM_VIMR_CHECK_VOLTAGE                 0x889AU
#define GD30BM2016_DM_VIMR_MAX_RELAX_CURRENT             0x889CU
#define GD30BM2016_DM_VIMR_THRESHOLD                     0x889EU
#define GD30BM2016_DM_VIMR_DELAY                         0x88A0U
#define GD30BM2016_DM_VIMR_RELAX_MIN_DURATION            0x88A2U
#define GD30BM2016_DM_VIMA_CHECK_VOLTAGE                 0x88A4U
#define GD30BM2016_DM_VIMA_MIN_ACTIVE_CURRENT            0x88A6U
#define GD30BM2016_DM_VIMA_THRESHOLD                     0x88A8U
#define GD30BM2016_DM_VIMA_DELAY                         0x88AAU
#define GD30BM2016_DM_CFETF_OFF_THRESHOLD                0x88ACU
#define GD30BM2016_DM_CFETF_OFF_DELAY                    0x88AEU
#define GD30BM2016_DM_DFETF_OFF_THRESHOLD                0x88B0U
#define GD30BM2016_DM_DFETF_OFF_DELAY                    0x88B2U
#define GD30BM2016_DM_VSSF_FAIL_THRESHOLD                0x88B4U
#define GD30BM2016_DM_VSSF_DELAY                         0x88B6U
#define GD30BM2016_DM_DUALLVL_DELAY                      0x88B7U
#define GD30BM2016_DM_LFOF_DELAY                         0x88B8U
#define GD30BM2016_DM_HWMX_DELAY                         0x88BAU
#define GD30BM2016_DM_SF_FAULT_MASK_A                    0x88BBU
#define GD30BM2016_DM_SF_FAULT_MASK_B                    0x88BCU
#define GD30BM2016_DM_SF_FAULT_MASK_C                    0x88BDU

/* 电芯均衡与负载检测寄存器。 */
#define GD30BM2016_DM_BALANCE_CONFIG                     0x8C00U
#define GD30BM2016_DM_BAL_MIN_CELL_TEMP                  0x8C01U
#define GD30BM2016_DM_BAL_MAX_CELL_TEMP                  0x8C02U
#define GD30BM2016_DM_BAL_MAX_INTERNAL_TEMP              0x8C03U
#define GD30BM2016_DM_BAL_CELL_INTERVAL                  0x8C04U
#define GD30BM2016_DM_BAL_MAX_CELLS                      0x8C05U
#define GD30BM2016_DM_BAL_MIN_CELL_V_CHARGE              0x8C06U
#define GD30BM2016_DM_BAL_MIN_DELTA_CHARGE               0x8C08U
#define GD30BM2016_DM_BAL_STOP_DELTA_CHARGE              0x8C09U
#define GD30BM2016_DM_BAL_MIN_CELL_V_RELAX               0x8C0AU
#define GD30BM2016_DM_BAL_MIN_DELTA_RELAX                0x8C0CU
#define GD30BM2016_DM_BAL_STOP_DELTA_RELAX               0x8C0DU
#define GD30BM2016_DM_LOAD_DETECT_ACTIVE_TIME            0x8C0EU
#define GD30BM2016_DM_LOAD_DETECT_RETRY_DELAY            0x8C0FU
#define GD30BM2016_DM_LOAD_DETECT_TIMEOUT                0x8C10U
#define GD30BM2016_DM_DSG_CURRENT_THRESHOLD              0x8C12U
#define GD30BM2016_DM_CHG_CURRENT_THRESHOLD              0x8C14U
#define GD30BM2016_DM_OPEN_WIRE_CHECK_TIME               0x8C16U

/* 常用位域定义。 */
#define GD30BM2016_CFETOFF_OPT_MASK                      0xFCU
#define GD30BM2016_CFETOFF_FXN_MASK                      0x03U
#define GD30BM2016_CFETOFF_DEFAULT                       0x10U
#define GD30BM2016_PIN_OPT_POLARITY_LOW                  0x80U
#define GD30BM2016_PIN_OPT_DIGITAL_HIZ                   0x40U
#define GD30BM2016_PIN_OPT_DRV_REG18                     0x20U
#define GD30BM2016_PIN_OPT_INPUT_ENABLE                  0x10U
#define GD30BM2016_PIN_OPT_PULLUP                        0x08U
#define GD30BM2016_PIN_OPT_PULLDOWN                      0x04U
#define GD30BM2016_PIN_FXN_UNUSED                        0x00U
#define GD30BM2016_PIN_FXN_GPO                           0x01U
#define GD30BM2016_PIN_FXN_STATUS                        0x02U
#define GD30BM2016_PIN_FXN_ADC_NTC                       0x03U

#define GD30BM2016_COMM_TYPE_I2C                         0x00U

#define GD30BM2016_FET_OPT_INIT_OFF                      0x20U
#define GD30BM2016_FET_OPT_PDSG_EN                       0x10U
#define GD30BM2016_FET_OPT_FET_CTRL_EN                   0x08U
#define GD30BM2016_FET_OPT_HOST_FET_EN                   0x04U
#define GD30BM2016_FET_OPT_SLEEP_CHG                     0x02U
#define GD30BM2016_FET_OPT_SERIES_FET                    0x01U
#define GD30BM2016_FET_OPTIONS_DEFAULT                   (GD30BM2016_FET_OPT_FET_CTRL_EN | \
                                                          GD30BM2016_FET_OPT_HOST_FET_EN | \
                                                          GD30BM2016_FET_OPT_SERIES_FET)
#define GD30BM2016_CHG_PUMP_SLEEP_CP_EN                  0x08U
#define GD30BM2016_CHG_PUMP_DSG_SFMODE_SLEEP             0x04U
#define GD30BM2016_CHG_PUMP_11V                          0x02U
#define GD30BM2016_CHG_PUMP_NORMAL_CP_EN                 0x01U

