shangxingchen0123456789-creator/BMS-GD32/GD32G553/Driver/afe_gd30bm2016_regs.h
#define GD30BM2016_SAFETY_A_CUV                          (1U << 2)
#define GD30BM2016_SAFETY_A_COV                          (1U << 3)
#define GD30BM2016_SAFETY_A_OCC                          (1U << 4)
#define GD30BM2016_SAFETY_A_OCD1                         (1U << 5)
#define GD30BM2016_SAFETY_A_OCD2                         (1U << 6)
#define GD30BM2016_SAFETY_A_SCD                          (1U << 7)
#define GD30BM2016_SAFETY_A_CRITICAL_MASK                (GD30BM2016_SAFETY_A_CUV | \
                                                          GD30BM2016_SAFETY_A_COV | \
                                                          GD30BM2016_SAFETY_A_OCC | \
                                                          GD30BM2016_SAFETY_A_OCD1 | \
                                                          GD30BM2016_SAFETY_A_OCD2 | \
                                                          GD30BM2016_SAFETY_A_SCD)

#define GD30BM2016_SAFETY_B_OTC                          (1U << 4)
#define GD30BM2016_SAFETY_B_OTD                          (1U << 5)
#define GD30BM2016_SAFETY_B_OTF                          (1U << 6)
#define GD30BM2016_SAFETY_B_OTINT                        (1U << 7)
#define GD30BM2016_SAFETY_B_OVERTEMP_MASK                (GD30BM2016_SAFETY_B_OTC | \
                                                          GD30BM2016_SAFETY_B_OTD | \
                                                          GD30BM2016_SAFETY_B_OTF | \
                                                          GD30BM2016_SAFETY_B_OTINT)

#define GD30BM2016_SAFETY_C_OCD3                         (1U << 4)
#define GD30BM2016_SAFETY_C_SCDL                         (1U << 5)
#define GD30BM2016_SAFETY_C_OCDL                         (1U << 6)
#define GD30BM2016_SAFETY_C_COVL                         (1U << 7)
#define GD30BM2016_SAFETY_C_CRITICAL_MASK                (GD30BM2016_SAFETY_C_OCD3 | \
                                                          GD30BM2016_SAFETY_C_SCDL | \
                                                          GD30BM2016_SAFETY_C_OCDL | \
                                                          GD30BM2016_SAFETY_C_COVL)

#define GD30BM2016_BAL_OPW_EN                            0x80U
#define GD30BM2016_BAL_CB_EN                             0x40U
#define GD30BM2016_BAL_CB_ALERT_MASK                     0x20U
#define GD30BM2016_BAL_CB_NO_CMD                         0x10U
#define GD30BM2016_BAL_CB_NOSLEEP                        0x08U
#define GD30BM2016_BAL_CB_SLEEP                          0x04U
#define GD30BM2016_BAL_CB_RLX                            0x02U
#define GD30BM2016_BAL_CB_CHG                            0x01U
#define GD30BM2016_BAL_DEFAULT                           (GD30BM2016_BAL_OPW_EN | GD30BM2016_BAL_CB_EN)

#define GD30BM2016_POWER_CFG_BALANCE_MASK                0x000CU
#define GD30BM2016_POWER_CFG_BALANCE_SHIFT               2U
#define GD30BM2016_POWER_CFG_LFO_DEEPSLEEP               0x0200U
#define GD30BM2016_POWER_CFG_LDO_DEEPSLEEP               0x0400U

/* 首次调试阶段相对安全且有用的 DEMO 参数值。 */
#define GD30BM2016_DEMO_FET_OPTIONS                      0x0DU
#define GD30BM2016_DEMO_CHG_PUMP_CONTROL                 0x09U
#define GD30BM2016_DEMO_BALANCE_CONFIG                   0xC3U
#define GD30BM2016_DEMO_REG12_CONFIG                     0x11U
#define GD30BM2016_DEMO_REG0_CONFIG                      0x01U
#define GD30BM2016_DEMO_COMM_IDLE_TIME                   0x00U
#define GD30BM2016_DEMO_MANUFACTURING_FET_EN             0x50U

/* 单体均衡活动电芯可通过子命令数据写入。 */
#define GD30BM2016_BALANCE_REGISTER_VALID                1

#endif
